In [1]:
import pandas as pd 
import numpy as np

In [2]:
s= pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns=['A','B','C','D'])
df 

df.head(3)

                   A         B         C         D
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209

In [8]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.values

array([[ 0.70796427, -0.29893561, -0.87521426, -2.42391301],
       [ 1.22672519,  1.81967899,  0.65969752,  0.97070339],
       [ 0.41539512, -1.28420941, -0.2912538 ,  1.56720857],
       [-1.45880295, -2.08107202,  0.8387128 , -1.43944871],
       [ 0.40634926, -0.2084    ,  1.02458095,  0.01945672],
       [ 0.67326989, -0.11218456,  0.04448534, -1.11608259]])

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.328483 -0.360854  0.233501 -0.403679
std    0.924957  1.315703  0.736760  1.524077
min   -1.458803 -2.081072 -0.875214 -2.423913
25%    0.408611 -1.037891 -0.207319 -1.358607
50%    0.544333 -0.253668  0.352091 -0.548313
75%    0.699291 -0.136238  0.793959  0.732892
max    1.226725  1.819679  1.024581  1.567209

In [20]:
df.sort_values(by='A',ascending = False)

KeyError: 0

In [22]:
df['A']

2013-01-01    0.707964
2013-01-02    1.226725
2013-01-03    0.415395
2013-01-04   -1.458803
2013-01-05    0.406349
2013-01-06    0.673270
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209

In [25]:
df ['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209
2013-01-04 -1.458803 -2.081072  0.838713 -1.439449

In [27]:
df.loc[dates[0]]

A    0.707964
B   -0.298936
C   -0.875214
D   -2.423913
Name: 2013-01-01 00:00:00, dtype: float64

In [29]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.707964 -0.298936
2013-01-02  1.226725  1.819679
2013-01-03  0.415395 -1.284209
2013-01-04 -1.458803 -2.081072
2013-01-05  0.406349 -0.208400
2013-01-06  0.673270 -0.112185

In [31]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.226725  1.819679
2013-01-03  0.415395 -1.284209
2013-01-04 -1.458803 -2.081072

In [33]:
df.loc['20130102',['A','B']]

A    1.226725
B    1.819679
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
df.loc[dates[0],'A']

0.7079642741536422

In [37]:
df.iloc[3]

A   -1.458803
B   -2.081072
C    0.838713
D   -1.439449
Name: 2013-01-04 00:00:00, dtype: float64

In [39]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.458803 -2.081072
2013-01-05  0.406349 -0.208400

In [41]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.226725  0.659698
2013-01-03  0.415395 -0.291254
2013-01-05  0.406349  1.024581

In [43]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209

In [45]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.298936 -0.875214
2013-01-02  1.819679  0.659698
2013-01-03 -1.284209 -0.291254
2013-01-04 -2.081072  0.838713
2013-01-05 -0.208400  1.024581
2013-01-06 -0.112185  0.044485

In [47]:
df

                   A         B         C         D
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209
2013-01-04 -1.458803 -2.081072  0.838713 -1.439449
2013-01-05  0.406349 -0.208400  1.024581  0.019457
2013-01-06  0.673270 -0.112185  0.044485 -1.116083

In [49]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209
2013-01-05  0.406349 -0.208400  1.024581  0.019457
2013-01-06  0.673270 -0.112185  0.044485 -1.116083

In [51]:
df[df>0]

                   A         B         C         D
2013-01-01  0.707964       NaN       NaN       NaN
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395       NaN       NaN  1.567209
2013-01-04       NaN       NaN  0.838713       NaN
2013-01-05  0.406349       NaN  1.024581  0.019457
2013-01-06  0.673270       NaN  0.044485       NaN

In [52]:
df2=df.copy()

In [54]:
df2['E'] =['one','one','two','three','four','three']

In [56]:
df2

                   A         B         C         D      E
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913    one
2013-01-02  1.226725  1.819679  0.659698  0.970703    one
2013-01-03  0.415395 -1.284209 -0.291254  1.567209    two
2013-01-04 -1.458803 -2.081072  0.838713 -1.439449  three
2013-01-05  0.406349 -0.208400  1.024581  0.019457   four
2013-01-06  0.673270 -0.112185  0.044485 -1.116083  three

In [63]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [65]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.415395 -1.284209 -0.291254  1.567209   two
2013-01-05  0.406349 -0.208400  1.024581  0.019457  four

In [67]:
df

                   A         B         C         D
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913
2013-01-02  1.226725  1.819679  0.659698  0.970703
2013-01-03  0.415395 -1.284209 -0.291254  1.567209
2013-01-04 -1.458803 -2.081072  0.838713 -1.439449
2013-01-05  0.406349 -0.208400  1.024581  0.019457
2013-01-06  0.673270 -0.112185  0.044485 -1.116083

In [69]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.707964 -0.298936 -0.875214 -2.423913
2013-01-02  1.934689  1.520743 -0.215517 -1.453210
2013-01-03  2.350085  0.236534 -0.506771  0.113999
2013-01-04  0.891282 -1.844538  0.331942 -1.325450
2013-01-05  1.297631 -2.052938  1.356523 -1.305993
2013-01-06  1.970901 -2.165123  1.401009 -2.422076

In [70]:
df.apply(lambda x : x.max() - x.min())

A    2.685528
B    3.900751
C    1.899795
D    3.991122
dtype: float64